"%1$@ •••• %2$@" = "%1$@ •••• %2$@";

"+ Add" = "+ Προσθήκη";

"Add US bank account" = "Προσθήκη τραπεζικού λογαριασμού στις Ηνωμένες Πολιτείες";

"Add a card" = "Προσθήκη μιας κάρτας";

"Add a payment method" = "Προσθέστε μια μέθοδο πληρωμής";

"Add bank account" = "Προσθήκη τραπεζικού λογαριασμού";

"Add card" = "Προσθήκη κάρτας";

"Add new card" = "Προσθήκη νέας κάρτας";

"Add new payment method" = "Προσθέστε νέα μέθοδο πληρωμής";

"Add your payment information" = "Προσθέστε τα στοιχεία πληρωμής σας";

"Agree and continue" = "Αποδοχή και συνέχεια";

"Approve payment" = "Έγκριση πληρωμής";

"Are you sure you want to remove this card?" = "Είστε βέβαιοι ότι θέλετε να αφαιρέσετε αυτήν την κάρτα;";

"Are you sure you want to remove this linked account?" = "Είστε βέβαιοι ότι θέλετε να αφαιρέσετε αυτόν τον συνδεδεμένο λογαριασμό;";

"Back" = "Πίσω";

"Bank" = "Τράπεζα";

"Bank account" = "Τραπεζικός λογαριασμός";

"Bank account details cannot be changed." = "Δεν είναι δυνατή η αλλαγή των στοιχείων τραπεζικού λογαριασμού.";

"Buy now or pay later with  <img/>" = "Αγορά τώρα ή πληρωμή αργότερα με <img/>";

"Buy now or pay later with Afterpay" = "Αγορά τώρα ή πληρωμή αργότερα με Afterpay";

"Buy now or pay later with Cash App Afterpay" = "Αγορά τώρα ή πληρωμή αργότερα με Cash App Afterpay";

"Buy now or pay later with Clearpay" = "Αγορά τώρα ή πληρωμή αργότερα με Clearpay";

"Buy now or pay later with Klarna" = "Αγορά τώρα ή πληρωμή αργότερα με Klarna";

"Buy using a UPI ID" = "Αγορά με χρήση αναγνωριστικού UPI";

"By confirming your payment with PayPal, you allow %@ to charge your PayPal account for future payments in accordance with their terms." = "Με την επιβεβαίωση της πληρωμής σας μέσω PayPal, επιτρέπετε στην %@ να χρεώσει τον λογαριασμό σας PayPal για μελλοντικές πληρωμές σύμφωνα με τους όρους της.";

"By continuing to Amazon Pay, you allow %@ to charge your Amazon Pay account for future payments in accordance with their terms." = "Αν συνεχίσετε στο Amazon Pay, επιτρέπετε στην %@ να χρεώνει τον λογαριασμό σας στο Amazon Pay για μελλοντικές πληρωμές σύμφωνα με τους όρους της.";

"By continuing to Klarna, you allow %@ to charge your Klarna account for future payments in accordance with their terms and Klarna's terms. You can change this at any time in your Klarna app or by reaching out to %@." = "Αν συνεχίσετε στην Klarna, επιτρέπετε στην %1$@ να χρεώνει τον λογαριασμό σας στην Klarna για μελλοντικές πληρωμές σύμφωνα με τους όρους της και τους όρους της Klarna. Μπορείτε να αλλάξετε αυτήν την επιλογή οποιαδήποτε στιγμή στην εφαρμογή Klarna ή επικοινωνώντας με την %2$@.";

"By continuing to PayPal, you allow %@ to charge your PayPal account for future payments in accordance with their terms." = "Εάν συνεχίσετε στο PayPal, επιτρέπετε στην %@ να χρεώσει τον λογαριασμό σας PayPal για μελλοντικές πληρωμές σύμφωνα με τους όρους της.";

"By continuing to Revolut Pay, you allow %@ to charge your Revolut Pay account for future payments in accordance with their terms." = "Αν συνεχίσετε στο Revolut Pay, επιτρέπετε στην %@ να χρεώνει τον λογαριασμό σας Revolut Pay για μελλοντικές πληρωμές σύμφωνα με τους όρους της.";

"By continuing you agree to the <terms>Terms</terms> and <privacy>Privacy Policy</privacy>." = "Αν συνεχίσετε, συμφωνείτε με τους <terms>Όρους</terms> και την <privacy>Πολιτική απορρήτου</privacy>.";

"By continuing, you agree to authorize payments pursuant to <terms>these terms</terms>." = "Εάν συνεχίσετε, συμφωνείτε να εξουσιοδοτείτε πληρωμές με βάση <terms>αυτούς τους όρους</terms>.";

"By continuing, you authorize %@ to debit your Cash App account for this payment and future payments in accordance with %@'s terms, until this authorization is revoked. You can change this anytime in your Cash App Settings." = "Συνεχίζοντας, εξουσιοδοτείτε την %1$@ να χρεώσει τον λογαριασμό σας Cash App για αυτήν την πληρωμή και μελλοντικές πληρωμές σύμφωνα με τους όρους της %2$@, μέχρι να ανακληθεί αυτή η εξουσιοδότηση. Μπορείτε να αλλάξετε αυτήν την επιλογή οποιαδήποτε στιγμή στις ρυθμίσεις Cash App.";

"By joining Link, you agree to the <terms>Terms</terms> and <privacy>Privacy Policy</privacy>." = "Με την εγγραφή σας στο Link, συμφωνείτε με τους <terms>Όρους</terms> και την <privacy>Πολιτική απορρήτου</privacy>.";

"By providing phone number and email, you agree to create a Link account subject to the Link <terms>Terms</terms> and <privacy>Privacy Policy</privacy>." = "Αν παράσχετε αριθμό τηλεφώνου και email, συμφωνείτε να δημιουργηθεί ένας λογαριασμός Link που υπόκειται στους <terms>Όρους</terms> και την <privacy>Πολιτική απορρήτου</privacy> του Link.";

"By providing your card information, you allow %@ to charge your card for future payments in accordance with their terms." = "Με την παροχή των στοιχείων της κάρτας σας, επιτρέπετε στην %@ να χρεώνει την κάρτα σας για μελλοντικές πληρωμές σύμφωνα με τους όρους της.";

"By providing your email, you agree to create a Link account and save your payment info to Link, according to the Link <terms>Terms</terms> and <privacy>Privacy Policy</privacy>." = "Αν παράσχετε το email σας, συμφωνείτε να δημιουργηθεί ένας λογαριασμός στο Link και να αποθηκευτούν τα στοιχεία πληρωμής σας στο Link, σύμφωνα με τους <terms>Όρους</terms> και την <privacy>Πολιτική απορρήτου</privacy> του Link.";

"By providing your payment information and confirming this payment, you authorise (A) %@ and Stripe, our payment service provider, to send instructions to your bank to debit your account and (B) your bank to debit your account in accordance with those instructions. As part of your rights, you are entitled to a refund from your bank under the terms and conditions of your agreement with your bank. A refund must be claimed within 8 weeks starting from the date on which your account was debited. Your rights are explained in a statement that you can obtain from your bank. You agree to receive notifications for future debits up to 2 days before they occur." = "Με την παροχή των στοιχείων πληρωμής σας και επιβεβαιώνοντας αυτήν την πληρωμή, εξουσιοδοτείτε (A) την %@ και την Stripe, τον πάροχο υπηρεσιών πληρωμών μας, να στείλουν οδηγίες στην τράπεζά σας προκειμένου να χρεώσει τον λογαριασμό σας και (B) την τράπεζά σας προκειμένου να χρεώσει τον λογαριασμό σας, σύμφωνα με τις οδηγίες αυτές. Στο πλαίσιο των δικαιωμάτων σας, δικαιούστε επιστροφή από την τράπεζά σας με βάση τους όρους και τις προϋποθέσεις που διατυπώνονται στη σύμβαση με την τράπεζά σας. Η αξίωση για επιστροφή πρέπει να υποβληθεί εντός 8 εβδομάδων από την ημερομηνία χρέωσης του λογαριασμού σας. Τα δικαιώματά σας επεξηγούνται σε αναλυτική κατάσταση, την οποία μπορείτε να εξασφαλίσετε από την τράπεζά σας. Συμφωνείτε να λαμβάνετε ειδοποιήσεις για μελλοντικές χρεώσεις έως και 2 ημέρες προτού προκύψουν.";

"By providing your phone number, you agree to create a Link account and save your payment info to Link, according to the Link <terms>Terms</terms> and <privacy>Privacy Policy</privacy>." = "Αν παράσχετε τον αριθμό τηλεφώνου σας, συμφωνείτε να δημιουργηθεί ένας λογαριασμός στο Link και να αποθηκευτούν τα στοιχεία πληρωμής σας στο Link, σύμφωνα με τους <terms>Όρους</terms> και την <privacy>Πολιτική απορρήτου</privacy> του Link.";

"By saving your bank account for %@ you agree to authorize payments pursuant to <terms>these terms</terms>." = "Αποθηκεύοντας τον τραπεζικό λογαριασμό σας για την %@, συμφωνείτε να εξουσιοδοτείτε πληρωμές σύμφωνα με <terms>αυτούς τους όρους</terms>.";

"CPF/CPNJ" = "CPF/CPNJ";

"Cancel and pay another way" = "Ακύρωση και πληρωμή με άλλον τρόπο";

"Card details cannot be changed." = "Δεν είναι δυνατή η αλλαγή των στοιχείων κάρτας.";

"Change" = "Αλλαγή";

"Choose a payment method" = "Επιλέξτε μέθοδο πληρωμής";

"Close card scanner" = "Κλείσιμο σαρωτή κάρτας";

"Code sent" = "Ο κωδικός εστάλη";

"Confirm" = "Επιβεβαίωση";

"Confirm it's you" = "Επιβεβαιώστε ότι είστε εσείς";

"Confirm payment details" = "Επιβεβαίωση στοιχείων πληρωμής";

"Confirm the payment in your bank or payment app within %@ to complete the purchase." = "Επιβεβαιώστε την πληρωμή στην εφαρμογή τράπεζας ή πληρωμής σας μέσα σε %@ για να ολοκληρώσετε την αγορά.";

"Confirm the payment in your bank's app within %@ to complete the purchase." = "Επιβεβαιώστε την πληρωμή στην εφαρμογή της τράπεζάς σας μέσα σε %@ για την ολοκλήρωση της αγοράς.";

"Confirm your CVC" = "Επιβεβαιώστε τον κωδικό CVC";

"Contact information" = "Στοιχεία επικοινωνίας";

"Continue another way" = "Συνέχεια με άλλο τρόπο";

"Debit or credit card" = "Χρεωστική ή πιστωτική κάρτα";

"Default" = "Προεπιλογή";

"Default payment method" = "Προεπιλεγμένη μέθοδος πληρωμής";

"EPS Bank" = "Τράπεζα με EPS";

"Enter address manually" = "Πληκτρολογήστε τη διεύθυνση";

"Enter the code sent to %@ to use your saved information." = "Εισαγάγετε τον κωδικό που στάλθηκε στο %@ για να χρησιμοποιήσετε τα αποθηκευμένα στοιχεία σας.";

"FPX Bank" = "FPX Bank";

"Failed to connect" = "Δεν ήταν δυνατή η σύνδεση";

"Fast, secure, 1⁠-⁠click checkout" = "Γρήγορη και ασφαλής ολοκλήρωση αγοράς με 1 κλικ";

"For security, please re-enter your card’s security code." = "Για λόγους ασφάλειας, εισαγάγετε πάλι τον κωδικό ασφαλείας της κάρτας σας.";

"Get %@ back when you pay for the first time with your bank. <terms>See terms</terms>" = "Λάβετε επιστροφή %@ όταν πληρώσετε για πρώτη φορά με την τράπεζά σας. <terms>Δείτε τους όρους</terms>";

"Get %@ back when you pay with your bank. <terms>See terms</terms>" = "Λάβετε επιστροφή %@ όταν πληρώσετε με την τράπεζά σας. <terms>Δείτε τους όρους</terms>";

"I understand that Stripe will be collecting Direct Debits on behalf of %@ and confirm that I am the account holder and the only person required to authorise debits from this account." = "Κατανοώ ότι η Stripe θα εισπράττει άμεσες χρεώσεις εκ μέρους της %@ και επιβεβαιώνω ότι είμαι ο δικαιούχος του λογαριασμού και το μόνο άτομο που απαιτείται για την έγκριση των χρεώσεων από αυτόν τον λογαριασμό.";

"IBAN" = "IBAN";

"Log in or sign up" = "Σύνδεση ή εγγραφή";

"Log out of Link" = "Αποσύνδεση από το Link";

"Manage SEPA debit" = "Διαχείριση χρέωσης SEPA";

"Manage US bank account" = "Διαχείριση τραπεζικού λογαριασμού στις Ηνωμένες Πολιτείες";

"Manage bank account" = "Διαχείριση τραπεζικού λογαριασμού";

"Manage card" = "Διαχείριση κάρτας";

"Manage cards" = "Διαχείριση καρτών";

"Manage payment method" = "Διαχείριση μεθόδου πληρωμής";

"Manage payment methods" = "Διαχείριση μεθόδων πληρωμής";

"Manage your payment methods" = "Διαχειριστείτε τις μεθόδους πληρωμής σας";

"Name on card" = "Όνομα στην κάρτα";

"New card" = "Νέα κάρτα";

"New payment method" = "Νέα μέθοδος πληρωμής";

"No %@ promo" = "Χωρίς προώθηση %@";

"Not you?" = "Δεν είστε εσείς;";

"Only card brand can be changed." = "Μπορείτε να αλλάξετε μόνο την επωνυμία κάρτας.";

"Open your UPI app to approve your payment within %@" = "Ανοίξτε την εφαρμογή UPI για να εγκρίνετε την πληρωμή σας σε %@";

"Or" = "Ή";

"Or pay using" = "Ή πληρωμή χρησιμοποιώντας";

"Or pay with a card" = "Ή πληρωμή με κάρτα";

"Or use" = "Ή χρησιμοποιήστε";

"Or use a card" = "Ή χρησιμοποιήστε μια κάρτα";

"Pay %@" = "Πληρωμή %@";

"Pay another way" = "Πληρωμή με άλλον τρόπο";

"Pay faster at %@ and thousands of businesses." = "Ταχύτερες πληρωμές στην %@ και σε χιλιάδες επιχειρήσεις.";

"Pay over time with %@" = "Πληρωμή σταδιακά με %@";

"Pay over time with Affirm" = "Πληρωμή σταδιακά με Affirm";

"Pay with Link" = "Πληρωμή με το Link";

"Pay with your bank account in just a few steps." = "Πληρώστε με τον τραπεζικό λογαριασμό σας με λίγα μόνο βήματα.";

"Payment" = "Πληρωμή";

"Payment failed" = "Η πληρωμή απέτυχε";

"Payment methods" = "Μέθοδοι πληρωμής";

"Please choose a valid payment method." = "Επιλέξτε μια έγκυρη μέθοδο πληρωμής.";

"Please go back and select another payment method" = "Πηγαίνετε πίσω και επιλέξτε μια άλλη μέθοδο πληρωμής";

"Point the camera at your card." = "Στρέψτε την κάμερα στην κάρτα σας.";

"Processing..." = "Επεξεργασία…";

"Przelewy24 Bank" = "Τράπεζα Przelewy24";

"Remove card?" = "Αφαίρεση κάρτας;";

"Remove linked account" = "Αφαίρεση συνδεδεμένου λογαριασμού";

"Resend code" = "Επανάληψη αποστολής κωδικού";

"SEPA debit details cannot be changed." = "Δεν είναι δυνατή η αλλαγή των στοιχείων χρέωσης SEPA.";

"Save" = "Αποθήκευση";

"Save a new payment method" = "Αποθήκευση νέας μεθόδου πληρωμής";

"Save address" = "Αποθήκευση διεύθυνσης";

"Save for future payments" = "Αποθήκευση για μελλοντικές πληρωμές";

"Save my info for faster checkout with Link" = "Αποθήκευση των στοιχείων μου για ταχύτερη ολοκλήρωση αγοράς με το Link";

"Save payment details to %@ for future purchases" = "Αποθήκευση στοιχείων πληρωμής στην %@ για μελλοντικές αγορές";

"Save this account for future %@ payments" = "Αποθηκεύστε αυτόν τον λογαριασμό για μελλοντικές %@ πληρωμές";

"Save your bank account in just a few steps." = "Αποθηκεύστε τον τραπεζικό λογαριασμό σας με λίγα μόνο βήματα.";

"Save your info for secure 1-click checkout with Link" = "Αποθήκευση των στοιχείων σας για ασφαλή ολοκλήρωση αγοράς με 1 κλικ μέσω Link";

"Save your payment information with Link, and securely check out in 1-click on Link-supported sites." = "Αποθηκεύστε τα στοιχεία πληρωμής σας με το Link, για ασφαλή ολοκλήρωση αγοράς με 1 κλικ στους ιστότοπους που υποστηρίζονται από το Link.";

"Saved" = "Αποθηκεύτηκε";

"Select card" = "Επιλέξτε κάρτα";

"Select payment method" = "Επιλέξτε μέθοδο πληρωμής";

"Select your payment method" = "Επιλέξτε τη μέθοδο πληρωμής σας";

"Set as default" = "Ορισμός ως προεπιλογή";

"Set as default payment method" = "Ορισμός ως προεπιλεγμένη μέθοδος πληρωμής";

"Set up" = "Διαμόρφωση";

"Shipping to %@ is not supported." = "Η αποστολή στη χώρα %@ δεν υποστηρίζεται.";

"Show menu" = "Εμφάνιση μενού";

"Simple, secure one-click payments" = "Απλές και ασφαλείς πληρωμές με ένα κλικ";

"Stripe will deposit $0.01 to your account in 1-2 business days. Then you'll get an email with instructions to finish saving your bank account with %@." = "Η Stripe θα καταθέσει 0,01 $ στον λογαριασμό σας σε 1-2 εργάσιμες ημέρες. Στη συνέχεια, θα λάβετε email με οδηγίες για να ολοκληρώσετε την αποθήκευση του τραπεζικού λογαριασμού σας με την %@.";

"Stripe will deposit $0.01 to your account in 1-2 business days. Then you’ll get an email with instructions to complete payment to %@." = "Η Stripe θα καταθέσει 0,01 $ στον λογαριασμό σας σε 1-2 εργάσιμες ημέρες. Στη συνέχεια, θα λάβετε email με οδηγίες για να ολοκληρώσετε την πληρωμή στην %@.";

"Tap to close" = "Πατήστε για κλείσιμο";

"Tap to expand" = "Πατήστε για ανάπτυξη";

"The IBAN you entered is incomplete." = "Ο κωδικός IBAN που εισαγάγατε είναι ελλιπής.";

"The provided verification code has expired." = "Ο κωδικός επαλήθευσης που παρασχέθηκε έχει λήξει.";

"The provided verification code is incorrect." = "Ο κωδικός επαλήθευσης που παρασχέθηκε είναι λανθασμένος.";

"This card has expired. Update your card info or choose a different payment method." = "Αυτή η κάρτα έχει λήξει. Ενημερώστε τα στοιχεία της κάρτας σας ή επιλέξτε διαφορετική μέθοδο πληρωμής.";

"This is your default" = "Αυτή είναι η προεπιλογή σας";

"Too many attempts. Please try again in a few minutes." = "Πραγματοποιήθηκαν πολλές προσπάθειες. Δοκιμάστε ξανά σε λίγα λεπτά.";

"Unavailable for this purchase" = "Δεν είναι διαθέσιμο για αυτήν την αγορά";

"Update card" = "Ενημέρωση κάρτας";

"Update payment method" = "Ενημέρωση μεθόδου πληρωμής";

"Use your saved info to check out faster" = "Χρησιμοποιήστε τα αποθηκευμένα στοιχεία σας για τη συντομότερη ολοκλήρωση της αγοράς";

"View more" = "Προβολή περισσότερων";

"Your IBAN should start with a two-letter country code." = "Ο κωδικός IBAN σας πρέπει να αρχίζει με έναν διψήφιο κωδικό χώρας.";

"iDEAL Bank" = "iDEAL Bank";
